stm32duino/Arduino_Core_STM32/boards.txt
# Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX=Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBTX.build.board=GENERIC_F072CBTX
GenF0.menu.pnum.GENERIC_F072CBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBTX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX=Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8UX.build.board=GENERIC_F072C8UX
GenF0.menu.pnum.GENERIC_F072C8UX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8UX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX=Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBUX.build.board=GENERIC_F072CBUX
GenF0.menu.pnum.GENERIC_F072CBUX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBUX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX=Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBYX.build.board=GENERIC_F072CBYX
GenF0.menu.pnum.GENERIC_F072CBYX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBYX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX=Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072R8TX.build.board=GENERIC_F072R8TX
GenF0.menu.pnum.GENERIC_F072R8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072R8TX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX=Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBTX.build.board=GENERIC_F072RBTX
GenF0.menu.pnum.GENERIC_F072RBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBTX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX=Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBHX.build.board=GENERIC_F072RBHX
GenF0.menu.pnum.GENERIC_F072RBHX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBHX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX=Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBIX.build.board=GENERIC_F072RBIX
GenF0.menu.pnum.GENERIC_F072RBIX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBIX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX=Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RBTX.build.board=GENERIC_F091RBTX
GenF0.menu.pnum.GENERIC_F091RBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RBTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX=Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCTX.build.board=GENERIC_F091RCTX
GenF0.menu.pnum.GENERIC_F091RCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX=Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCHX.build.board=GENERIC_F091RCHX
GenF0.menu.pnum.GENERIC_F091RCHX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCHX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX=Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCYX.build.board=GENERIC_F091RCYX
GenF0.menu.pnum.GENERIC_F091RCYX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCYX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=-g
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=-g
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF1.upload.maximum_size=0
GenF1.upload.maximum_data_size=0

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant_h=variant_{build.board}.h

