stm32duino/Arduino_Core_STM32/boards.txt
# Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX=Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401RETX.build.board=GENERIC_F401RETX
GenF4.menu.pnum.GENERIC_F401RETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401RETX.build.variant=STM32F4xx/F401R(B-C-D-E)T

# Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX=Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VBTX.build.board=GENERIC_F401VBTX
GenF4.menu.pnum.GENERIC_F401VBTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VBTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX=Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VCTX.build.board=GENERIC_F401VCTX
GenF4.menu.pnum.GENERIC_F401VCTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VCTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX=Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VDTX.build.board=GENERIC_F401VDTX
GenF4.menu.pnum.GENERIC_F401VDTX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VDTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX=Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VETX.build.board=GENERIC_F401VETX
GenF4.menu.pnum.GENERIC_F401VETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VETX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX=Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F405RGTX.build.board=GENERIC_F405RGTX
GenF4.menu.pnum.GENERIC_F405RGTX.build.product_line=STM32F405xx
GenF4.menu.pnum.GENERIC_F405RGTX.build.variant=STM32F4xx/F405RGT_F415RGT

# Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX=Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VETX.build.board=GENERIC_F407VETX
GenF4.menu.pnum.GENERIC_F407VETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VETX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX=Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VGTX.build.board=GENERIC_F407VGTX
GenF4.menu.pnum.GENERIC_F407VGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VGTX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX=Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZETX.build.board=GENERIC_F407ZETX
GenF4.menu.pnum.GENERIC_F407ZETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZETX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX=Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZGTX.build.board=GENERIC_F407ZGTX
GenF4.menu.pnum.GENERIC_F407ZGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZGTX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F410C8Tx
GenF4.menu.pnum.GENERIC_F410C8TX=Generic F410C8Tx
GenF4.menu.pnum.GENERIC_F410C8TX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410C8TX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410C8TX.build.board=GENERIC_F410C8TX
GenF4.menu.pnum.GENERIC_F410C8TX.build.product_line=STM32F410Cx
GenF4.menu.pnum.GENERIC_F410C8TX.build.variant=STM32F4xx/F410C(8-B)T

# Generic F410C8Ux
GenF4.menu.pnum.GENERIC_F410C8UX=Generic F410C8Ux
GenF4.menu.pnum.GENERIC_F410C8UX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410C8UX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410C8UX.build.board=GENERIC_F410C8UX
GenF4.menu.pnum.GENERIC_F410C8UX.build.product_line=STM32F410Cx
GenF4.menu.pnum.GENERIC_F410C8UX.build.variant=STM32F4xx/F410C(8-B)U

# Generic F410CBTx
GenF4.menu.pnum.GENERIC_F410CBTX=Generic F410CBTx
GenF4.menu.pnum.GENERIC_F410CBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410CBTX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410CBTX.build.board=GENERIC_F410CBTX
GenF4.menu.pnum.GENERIC_F410CBTX.build.product_line=STM32F410Cx
GenF4.menu.pnum.GENERIC_F410CBTX.build.variant=STM32F4xx/F410C(8-B)T

# Generic F410CBUx
GenF4.menu.pnum.GENERIC_F410CBUX=Generic F410CBUx
GenF4.menu.pnum.GENERIC_F410CBUX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410CBUX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410CBUX.build.board=GENERIC_F410CBUX
GenF4.menu.pnum.GENERIC_F410CBUX.build.product_line=STM32F410Cx
GenF4.menu.pnum.GENERIC_F410CBUX.build.variant=STM32F4xx/F410C(8-B)U

# Generic F410R8Ix
GenF4.menu.pnum.GENERIC_F410R8IX=Generic F410R8Ix
GenF4.menu.pnum.GENERIC_F410R8IX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410R8IX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410R8IX.build.board=GENERIC_F410R8IX
GenF4.menu.pnum.GENERIC_F410R8IX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410R8IX.build.variant=STM32F4xx/F410R(8-B)(I-T)

# Generic F410RBIx
GenF4.menu.pnum.GENERIC_F410RBIX=Generic F410RBIx
GenF4.menu.pnum.GENERIC_F410RBIX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410RBIX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410RBIX.build.board=GENERIC_F410RBIX
GenF4.menu.pnum.GENERIC_F410RBIX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410RBIX.build.variant=STM32F4xx/F410R(8-B)(I-T)

# Generic F410R8Tx
GenF4.menu.pnum.GENERIC_F410R8TX=Generic F410R8Tx
GenF4.menu.pnum.GENERIC_F410R8TX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410R8TX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410R8TX.build.board=GENERIC_F410R8TX
GenF4.menu.pnum.GENERIC_F410R8TX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410R8TX.build.variant=STM32F4xx/F410R(8-B)(I-T)

