stm32duino/Arduino_Core_STM32/boards.txt
# Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX=Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RCTX.build.board=GENERIC_F446RCTX
GenF4.menu.pnum.GENERIC_F446RCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RCTX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX=Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RETX.build.board=GENERIC_F446RETX
GenF4.menu.pnum.GENERIC_F446RETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RETX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX=Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VCTX.build.board=GENERIC_F446VCTX
GenF4.menu.pnum.GENERIC_F446VCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VCTX.build.variant=STM32F4xx/F446V(C-E)T

# Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX=Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VETX.build.board=GENERIC_F446VETX
GenF4.menu.pnum.GENERIC_F446VETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VETX.build.variant=STM32F4xx/F446V(C-E)T

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=-g
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=-g
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Generic F7

GenF7.name=Generic STM32F7 series

GenF7.build.core=arduino
GenF7.build.board=GenF7
GenF7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF7.build.mcu=cortex-m7
GenF7.build.fpu=-mfpu=fpv4-sp-d16
GenF7.build.float-abi=-mfloat-abi=hard
GenF7.build.series=STM32F7xx
GenF7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
GenF7.upload.maximum_size=0
GenF7.upload.maximum_data_size=0

# Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX=Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F722RCTX.build.board=GENERIC_F722RCTX
GenF7.menu.pnum.GENERIC_F722RCTX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RCTX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX=Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F722RETX.build.board=GENERIC_F722RETX
GenF7.menu.pnum.GENERIC_F722RETX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RETX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F730R8Tx
GenF7.menu.pnum.GENERIC_F730R8TX=Generic F730R8Tx
GenF7.menu.pnum.GENERIC_F730R8TX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F730R8TX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F730R8TX.build.board=GENERIC_F730R8TX
GenF7.menu.pnum.GENERIC_F730R8TX.build.product_line=STM32F730xx
GenF7.menu.pnum.GENERIC_F730R8TX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F732RETx
GenF7.menu.pnum.GENERIC_F732RETX=Generic F732RETx
GenF7.menu.pnum.GENERIC_F732RETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F732RETX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F732RETX.build.board=GENERIC_F732RETX
GenF7.menu.pnum.GENERIC_F732RETX.build.product_line=STM32F732xx
GenF7.menu.pnum.GENERIC_F732RETX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F745ZETx
GenF7.menu.pnum.GENERIC_F745ZETX=Generic F745ZETx
GenF7.menu.pnum.GENERIC_F745ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F745ZETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F745ZETX.build.board=GENERIC_F745ZETX
GenF7.menu.pnum.GENERIC_F745ZETX.build.product_line=STM32F745xx
GenF7.menu.pnum.GENERIC_F745ZETX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F745ZGTx
GenF7.menu.pnum.GENERIC_F745ZGTX=Generic F745ZGTx
GenF7.menu.pnum.GENERIC_F745ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F745ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F745ZGTX.build.board=GENERIC_F745ZGTX
GenF7.menu.pnum.GENERIC_F745ZGTX.build.product_line=STM32F745xx
GenF7.menu.pnum.GENERIC_F745ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746BETx
GenF7.menu.pnum.GENERIC_F746BETX=Generic F746BETx
GenF7.menu.pnum.GENERIC_F746BETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746BETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746BETX.build.board=GENERIC_F746BETX
GenF7.menu.pnum.GENERIC_F746BETX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746BETX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746BGTx
GenF7.menu.pnum.GENERIC_F746BGTX=Generic F746BGTx
GenF7.menu.pnum.GENERIC_F746BGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746BGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746BGTX.build.board=GENERIC_F746BGTX
GenF7.menu.pnum.GENERIC_F746BGTX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746BGTX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746NEHx
GenF7.menu.pnum.GENERIC_F746NEHX=Generic F746NEHx
GenF7.menu.pnum.GENERIC_F746NEHX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746NEHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746NEHX.build.board=GENERIC_F746NEHX
GenF7.menu.pnum.GENERIC_F746NEHX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746NEHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746NGHx
GenF7.menu.pnum.GENERIC_F746NGHX=Generic F746NGHx
GenF7.menu.pnum.GENERIC_F746NGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746NGHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746NGHX.build.board=GENERIC_F746NGHX
GenF7.menu.pnum.GENERIC_F746NGHX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746NGHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

