stm32duino/Arduino_Core_STM32/boards.txt
# Generic F746ZETx
GenF7.menu.pnum.GENERIC_F746ZETX=Generic F746ZETx
GenF7.menu.pnum.GENERIC_F746ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746ZETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZETX.build.board=GENERIC_F746ZETX
GenF7.menu.pnum.GENERIC_F746ZETX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZETX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZEYx
GenF7.menu.pnum.GENERIC_F746ZEYX=Generic F746ZEYx
GenF7.menu.pnum.GENERIC_F746ZEYX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746ZEYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZEYX.build.board=GENERIC_F746ZEYX
GenF7.menu.pnum.GENERIC_F746ZEYX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZEYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZGTx
GenF7.menu.pnum.GENERIC_F746ZGTX=Generic F746ZGTx
GenF7.menu.pnum.GENERIC_F746ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZGTX.build.board=GENERIC_F746ZGTX
GenF7.menu.pnum.GENERIC_F746ZGTX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZGYx
GenF7.menu.pnum.GENERIC_F746ZGYX=Generic F746ZGYx
GenF7.menu.pnum.GENERIC_F746ZGYX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746ZGYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZGYX.build.board=GENERIC_F746ZGYX
GenF7.menu.pnum.GENERIC_F746ZGYX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZGYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F750N8Hx
GenF7.menu.pnum.GENERIC_F750N8HX=Generic F750N8Hx
GenF7.menu.pnum.GENERIC_F750N8HX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F750N8HX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F750N8HX.build.board=GENERIC_F750N8HX
GenF7.menu.pnum.GENERIC_F750N8HX.build.product_line=STM32F750xx
GenF7.menu.pnum.GENERIC_F750N8HX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F750Z8Tx
GenF7.menu.pnum.GENERIC_F750Z8TX=Generic F750Z8Tx
GenF7.menu.pnum.GENERIC_F750Z8TX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F750Z8TX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F750Z8TX.build.board=GENERIC_F750Z8TX
GenF7.menu.pnum.GENERIC_F750Z8TX.build.product_line=STM32F750xx
GenF7.menu.pnum.GENERIC_F750Z8TX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F756BGTx
GenF7.menu.pnum.GENERIC_F756BGTX=Generic F756BGTx
GenF7.menu.pnum.GENERIC_F756BGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756BGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756BGTX.build.board=GENERIC_F756BGTX
GenF7.menu.pnum.GENERIC_F756BGTX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756BGTX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F756NGHx
GenF7.menu.pnum.GENERIC_F756NGHX=Generic F756NGHx
GenF7.menu.pnum.GENERIC_F756NGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756NGHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756NGHX.build.board=GENERIC_F756NGHX
GenF7.menu.pnum.GENERIC_F756NGHX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756NGHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F756ZGTx
GenF7.menu.pnum.GENERIC_F756ZGTX=Generic F756ZGTx
GenF7.menu.pnum.GENERIC_F756ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756ZGTX.build.board=GENERIC_F756ZGTX
GenF7.menu.pnum.GENERIC_F756ZGTX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F756ZGYx
GenF7.menu.pnum.GENERIC_F756ZGYX=Generic F756ZGYx
GenF7.menu.pnum.GENERIC_F756ZGYX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756ZGYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756ZGYX.build.board=GENERIC_F756ZGYX
GenF7.menu.pnum.GENERIC_F756ZGYX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756ZGYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F765IGKx
GenF7.menu.pnum.GENERIC_F765IGKX=Generic F765IGKx
GenF7.menu.pnum.GENERIC_F765IGKX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765IGKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IGKX.build.board=GENERIC_F765IGKX
GenF7.menu.pnum.GENERIC_F765IGKX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IGKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F765IIKx
GenF7.menu.pnum.GENERIC_F765IIKX=Generic F765IIKx
GenF7.menu.pnum.GENERIC_F765IIKX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765IIKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IIKX.build.board=GENERIC_F765IIKX
GenF7.menu.pnum.GENERIC_F765IIKX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IIKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F765IGTx
GenF7.menu.pnum.GENERIC_F765IGTX=Generic F765IGTx
GenF7.menu.pnum.GENERIC_F765IGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765IGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IGTX.build.board=GENERIC_F765IGTX
GenF7.menu.pnum.GENERIC_F765IGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IGTX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F765IITx
GenF7.menu.pnum.GENERIC_F765IITX=Generic F765IITx
GenF7.menu.pnum.GENERIC_F765IITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765IITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IITX.build.board=GENERIC_F765IITX
GenF7.menu.pnum.GENERIC_F765IITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IITX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F765VGHx
GenF7.menu.pnum.GENERIC_F765VGHX=Generic F765VGHx
GenF7.menu.pnum.GENERIC_F765VGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765VGHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VGHX.build.board=GENERIC_F765VGHX
GenF7.menu.pnum.GENERIC_F765VGHX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VGHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F765VGTx
GenF7.menu.pnum.GENERIC_F765VGTX=Generic F765VGTx
GenF7.menu.pnum.GENERIC_F765VGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765VGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VGTX.build.board=GENERIC_F765VGTX
GenF7.menu.pnum.GENERIC_F765VGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VGTX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F765VIHx
GenF7.menu.pnum.GENERIC_F765VIHX=Generic F765VIHx
GenF7.menu.pnum.GENERIC_F765VIHX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765VIHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VIHX.build.board=GENERIC_F765VIHX
GenF7.menu.pnum.GENERIC_F765VIHX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VIHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F765VITx
GenF7.menu.pnum.GENERIC_F765VITX=Generic F765VITx
GenF7.menu.pnum.GENERIC_F765VITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765VITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VITX.build.board=GENERIC_F765VITX
GenF7.menu.pnum.GENERIC_F765VITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VITX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F765ZGTx
GenF7.menu.pnum.GENERIC_F765ZGTX=Generic F765ZGTx
GenF7.menu.pnum.GENERIC_F765ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765ZGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765ZGTX.build.board=GENERIC_F765ZGTX
GenF7.menu.pnum.GENERIC_F765ZGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765ZGTX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT

# Generic F765ZITx
GenF7.menu.pnum.GENERIC_F765ZITX=Generic F765ZITx
GenF7.menu.pnum.GENERIC_F765ZITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765ZITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765ZITX.build.board=GENERIC_F765ZITX
GenF7.menu.pnum.GENERIC_F765ZITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765ZITX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT

# Generic F767IGKx
GenF7.menu.pnum.GENERIC_F767IGKX=Generic F767IGKx
GenF7.menu.pnum.GENERIC_F767IGKX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767IGKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IGKX.build.board=GENERIC_F767IGKX
GenF7.menu.pnum.GENERIC_F767IGKX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IGKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

