stm32duino/Arduino_Core_STM32/boards.txt
# Generic F767IIKx
GenF7.menu.pnum.GENERIC_F767IIKX=Generic F767IIKx
GenF7.menu.pnum.GENERIC_F767IIKX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767IIKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IIKX.build.board=GENERIC_F767IIKX
GenF7.menu.pnum.GENERIC_F767IIKX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IIKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F767IGTx
GenF7.menu.pnum.GENERIC_F767IGTX=Generic F767IGTx
GenF7.menu.pnum.GENERIC_F767IGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767IGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IGTX.build.board=GENERIC_F767IGTX
GenF7.menu.pnum.GENERIC_F767IGTX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IGTX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F767IITx
GenF7.menu.pnum.GENERIC_F767IITX=Generic F767IITx
GenF7.menu.pnum.GENERIC_F767IITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767IITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IITX.build.board=GENERIC_F767IITX
GenF7.menu.pnum.GENERIC_F767IITX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IITX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F767VGHx
GenF7.menu.pnum.GENERIC_F767VGHX=Generic F767VGHx
GenF7.menu.pnum.GENERIC_F767VGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767VGHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767VGHX.build.board=GENERIC_F767VGHX
GenF7.menu.pnum.GENERIC_F767VGHX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767VGHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F767VGTx
GenF7.menu.pnum.GENERIC_F767VGTX=Generic F767VGTx
GenF7.menu.pnum.GENERIC_F767VGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767VGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767VGTX.build.board=GENERIC_F767VGTX
GenF7.menu.pnum.GENERIC_F767VGTX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767VGTX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F767VIHx
GenF7.menu.pnum.GENERIC_F767VIHX=Generic F767VIHx
GenF7.menu.pnum.GENERIC_F767VIHX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767VIHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767VIHX.build.board=GENERIC_F767VIHX
GenF7.menu.pnum.GENERIC_F767VIHX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767VIHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F767VITx
GenF7.menu.pnum.GENERIC_F767VITX=Generic F767VITx
GenF7.menu.pnum.GENERIC_F767VITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767VITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767VITX.build.board=GENERIC_F767VITX
GenF7.menu.pnum.GENERIC_F767VITX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767VITX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F767ZGTx
GenF7.menu.pnum.GENERIC_F767ZGTX=Generic F767ZGTx
GenF7.menu.pnum.GENERIC_F767ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767ZGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767ZGTX.build.board=GENERIC_F767ZGTX
GenF7.menu.pnum.GENERIC_F767ZGTX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767ZGTX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT

# Generic F767ZITx
GenF7.menu.pnum.GENERIC_F767ZITX=Generic F767ZITx
GenF7.menu.pnum.GENERIC_F767ZITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767ZITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767ZITX.build.board=GENERIC_F767ZITX
GenF7.menu.pnum.GENERIC_F767ZITX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767ZITX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT

# Generic F777IIKx
GenF7.menu.pnum.GENERIC_F777IIKX=Generic F777IIKx
GenF7.menu.pnum.GENERIC_F777IIKX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F777IIKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F777IIKX.build.board=GENERIC_F777IIKX
GenF7.menu.pnum.GENERIC_F777IIKX.build.product_line=STM32F777xx
GenF7.menu.pnum.GENERIC_F777IIKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F777IITx
GenF7.menu.pnum.GENERIC_F777IITX=Generic F777IITx
GenF7.menu.pnum.GENERIC_F777IITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F777IITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F777IITX.build.board=GENERIC_F777IITX
GenF7.menu.pnum.GENERIC_F777IITX.build.product_line=STM32F777xx
GenF7.menu.pnum.GENERIC_F777IITX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

# Generic F777VIHx
GenF7.menu.pnum.GENERIC_F777VIHX=Generic F777VIHx
GenF7.menu.pnum.GENERIC_F777VIHX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F777VIHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F777VIHX.build.board=GENERIC_F777VIHX
GenF7.menu.pnum.GENERIC_F777VIHX.build.product_line=STM32F777xx
GenF7.menu.pnum.GENERIC_F777VIHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F777VITx
GenF7.menu.pnum.GENERIC_F777VITX=Generic F777VITx
GenF7.menu.pnum.GENERIC_F777VITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F777VITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F777VITX.build.board=GENERIC_F777VITX
GenF7.menu.pnum.GENERIC_F777VITX.build.product_line=STM32F777xx
GenF7.menu.pnum.GENERIC_F777VITX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)

# Generic F777ZITx
GenF7.menu.pnum.GENERIC_F777ZITX=Generic F777ZITx
GenF7.menu.pnum.GENERIC_F777ZITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F777ZITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F777ZITX.build.board=GENERIC_F777ZITX
GenF7.menu.pnum.GENERIC_F777ZITX.build.product_line=STM32F777xx
GenF7.menu.pnum.GENERIC_F777ZITX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT

# Upload menu
GenF7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF7.menu.upload_method.swdMethod.upload.protocol=0
GenF7.menu.upload_method.swdMethod.upload.options=-g
GenF7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

