stm32duino/Arduino_Core_STM32/boards.txt
# Generic G031K4Ux
GenG0.menu.pnum.GENERIC_G031K4UX=Generic G031K4Ux
GenG0.menu.pnum.GENERIC_G031K4UX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4UX.build.board=GENERIC_G031K4UX
GenG0.menu.pnum.GENERIC_G031K4UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K6Ux
GenG0.menu.pnum.GENERIC_G031K6UX=Generic G031K6Ux
GenG0.menu.pnum.GENERIC_G031K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6UX.build.board=GENERIC_G031K6UX
GenG0.menu.pnum.GENERIC_G031K6UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K8Ux
GenG0.menu.pnum.GENERIC_G031K8UX=Generic G031K8Ux
GenG0.menu.pnum.GENERIC_G031K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8UX.build.board=GENERIC_G031K8UX
GenG0.menu.pnum.GENERIC_G031K8UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041F6Px
GenG0.menu.pnum.GENERIC_G041F6PX=Generic G041F6Px
GenG0.menu.pnum.GENERIC_G041F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041F6PX.build.board=GENERIC_G041F6PX
GenG0.menu.pnum.GENERIC_G041F6PX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041F6PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G041F8Px
GenG0.menu.pnum.GENERIC_G041F8PX=Generic G041F8Px
GenG0.menu.pnum.GENERIC_G041F8PX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041F8PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041F8PX.build.board=GENERIC_G041F8PX
GenG0.menu.pnum.GENERIC_G041F8PX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041F8PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G041J6Mx
GenG0.menu.pnum.GENERIC_G041J6MX=Generic G041J6Mx
GenG0.menu.pnum.GENERIC_G041J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041J6MX.build.board=GENERIC_G041J6MX
GenG0.menu.pnum.GENERIC_G041J6MX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G041K6Tx
GenG0.menu.pnum.GENERIC_G041K6TX=Generic G041K6Tx
GenG0.menu.pnum.GENERIC_G041K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K6TX.build.board=GENERIC_G041K6TX
GenG0.menu.pnum.GENERIC_G041K6TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K6TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K8Tx
GenG0.menu.pnum.GENERIC_G041K8TX=Generic G041K8Tx
GenG0.menu.pnum.GENERIC_G041K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K8TX.build.board=GENERIC_G041K8TX
GenG0.menu.pnum.GENERIC_G041K8TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K8TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K6Ux
GenG0.menu.pnum.GENERIC_G041K6UX=Generic G041K6Ux
GenG0.menu.pnum.GENERIC_G041K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041K6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K6UX.build.board=GENERIC_G041K6UX
GenG0.menu.pnum.GENERIC_G041K6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K6UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX=Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K8UX.build.board=GENERIC_G041K8UX
GenG0.menu.pnum.GENERIC_G041K8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K8UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041Y8Yx
GenG0.menu.pnum.GENERIC_G041Y8YX=Generic G041Y8Yx
GenG0.menu.pnum.GENERIC_G041Y8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041Y8YX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041Y8YX.build.board=GENERIC_G041Y8YX
GenG0.menu.pnum.GENERIC_G041Y8YX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041Y8YX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G050C6Tx
GenG0.menu.pnum.GENERIC_G050C6TX=Generic G050C6Tx
GenG0.menu.pnum.GENERIC_G050C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050C6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050C6TX.build.board=GENERIC_G050C6TX
GenG0.menu.pnum.GENERIC_G050C6TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050C6TX.build.variant=STM32G0xx/G050C(6-8)T

# Generic G050C8Tx
GenG0.menu.pnum.GENERIC_G050C8TX=Generic G050C8Tx
GenG0.menu.pnum.GENERIC_G050C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G050C8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050C8TX.build.board=GENERIC_G050C8TX
GenG0.menu.pnum.GENERIC_G050C8TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050C8TX.build.variant=STM32G0xx/G050C(6-8)T

# Generic G050F6Px
GenG0.menu.pnum.GENERIC_G050F6PX=Generic G050F6Px
GenG0.menu.pnum.GENERIC_G050F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050F6PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050F6PX.build.board=GENERIC_G050F6PX
GenG0.menu.pnum.GENERIC_G050F6PX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050F6PX.build.variant=STM32G0xx/G050F6P

# Generic G050K6Tx
GenG0.menu.pnum.GENERIC_G050K6TX=Generic G050K6Tx
GenG0.menu.pnum.GENERIC_G050K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050K6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050K6TX.build.board=GENERIC_G050K6TX
GenG0.menu.pnum.GENERIC_G050K6TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050K6TX.build.variant=STM32G0xx/G050K(6-8)T

