stm32duino/Arduino_Core_STM32/boards.txt
# Generic L082CZYx
GenL0.menu.pnum.GENERIC_L082CZYX=Generic L082CZYx
GenL0.menu.pnum.GENERIC_L082CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082CZYX.build.board=GENERIC_L082CZYX
GenL0.menu.pnum.GENERIC_L082CZYX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L082KBTx
GenL0.menu.pnum.GENERIC_L082KBTX=Generic L082KBTx
GenL0.menu.pnum.GENERIC_L082KBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L082KBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KBTX.build.board=GENERIC_L082KBTX
GenL0.menu.pnum.GENERIC_L082KBTX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KBTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T

# Generic L082KZTx
GenL0.menu.pnum.GENERIC_L082KZTX=Generic L082KZTx
GenL0.menu.pnum.GENERIC_L082KZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L082KZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L082KZTX.build.board=GENERIC_L082KZTX
GenL0.menu.pnum.GENERIC_L082KZTX.build.product_line=STM32L082xx
GenL0.menu.pnum.GENERIC_L082KZTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T

# Generic L083RBTx
GenL0.menu.pnum.GENERIC_L083RBTX=Generic L083RBTx
GenL0.menu.pnum.GENERIC_L083RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RBTX.build.board=GENERIC_L083RBTX
GenL0.menu.pnum.GENERIC_L083RBTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L083RZTx
GenL0.menu.pnum.GENERIC_L083RZTX=Generic L083RZTx
GenL0.menu.pnum.GENERIC_L083RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083RZTX.build.board=GENERIC_L083RZTX
GenL0.menu.pnum.GENERIC_L083RZTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=0
GenL0.menu.upload_method.swdMethod.upload.options=-g
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=1
GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=2
GenL0.menu.upload_method.dfuMethod.upload.options=-g
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic L1
GenL1.name=Generic STM32L1 series

GenL1.build.core=arduino
GenL1.build.board=GenL1
GenL1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL1.build.mcu=cortex-m3
GenL1.build.series=STM32L1xx
GenL1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenL1.upload.maximum_size=0
GenL1.upload.maximum_data_size=0

# Generic L100C6Ux
GenL1.menu.pnum.GENERIC_L100C6UX=Generic L100C6Ux
GenL1.menu.pnum.GENERIC_L100C6UX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L100C6UX.upload.maximum_data_size=4096
GenL1.menu.pnum.GENERIC_L100C6UX.build.board=GENERIC_L100C6UX
GenL1.menu.pnum.GENERIC_L100C6UX.build.product_line=STM32L100xB
GenL1.menu.pnum.GENERIC_L100C6UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L100C6UxA
GenL1.menu.pnum.GENERIC_L100C6UXA=Generic L100C6UxA
GenL1.menu.pnum.GENERIC_L100C6UXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L100C6UXA.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L100C6UXA.build.board=GENERIC_L100C6UXA
GenL1.menu.pnum.GENERIC_L100C6UXA.build.product_line=STM32L100xB
GenL1.menu.pnum.GENERIC_L100C6UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151C6Tx
GenL1.menu.pnum.GENERIC_L151C6TX=Generic L151C6Tx
GenL1.menu.pnum.GENERIC_L151C6TX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C6TX.build.board=GENERIC_L151C6TX
GenL1.menu.pnum.GENERIC_L151C6TX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151C8Tx
GenL1.menu.pnum.GENERIC_L151C8TX=Generic L151C8Tx
GenL1.menu.pnum.GENERIC_L151C8TX.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C8TX.build.board=GENERIC_L151C8TX
GenL1.menu.pnum.GENERIC_L151C8TX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C8TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151CBTx
GenL1.menu.pnum.GENERIC_L151CBTX=Generic L151CBTx
GenL1.menu.pnum.GENERIC_L151CBTX.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBTX.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151CBTX.build.board=GENERIC_L151CBTX
GenL1.menu.pnum.GENERIC_L151CBTX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151CBTX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151C6TxA
GenL1.menu.pnum.GENERIC_L151C6TXA=Generic L151C6TxA
GenL1.menu.pnum.GENERIC_L151C6TXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6TXA.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151C6TXA.build.board=GENERIC_L151C6TXA
GenL1.menu.pnum.GENERIC_L151C6TXA.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151C8TxA
GenL1.menu.pnum.GENERIC_L151C8TXA=Generic L151C8TxA
GenL1.menu.pnum.GENERIC_L151C8TXA.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8TXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151C8TXA.build.board=GENERIC_L151C8TXA
GenL1.menu.pnum.GENERIC_L151C8TXA.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C8TXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151CBTxA
GenL1.menu.pnum.GENERIC_L151CBTXA=Generic L151CBTxA
GenL1.menu.pnum.GENERIC_L151CBTXA.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBTXA.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151CBTXA.build.board=GENERIC_L151CBTXA
GenL1.menu.pnum.GENERIC_L151CBTXA.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151CBTXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

# Generic L151C6Ux
GenL1.menu.pnum.GENERIC_L151C6UX=Generic L151C6Ux
GenL1.menu.pnum.GENERIC_L151C6UX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6UX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C6UX.build.board=GENERIC_L151C6UX
GenL1.menu.pnum.GENERIC_L151C6UX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)

