stm32duino/Arduino_Core_STM32/boards.txt
# Generic L151RETx
GenL1.menu.pnum.GENERIC_L151RETX=Generic L151RETx
GenL1.menu.pnum.GENERIC_L151RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L151RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L151RETX.build.board=GENERIC_L151RETX
GenL1.menu.pnum.GENERIC_L151RETX.build.product_line=STM32L151xE
GenL1.menu.pnum.GENERIC_L151RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET

# Generic L152RETx
GenL1.menu.pnum.GENERIC_L152RETX=Generic L152RETx
GenL1.menu.pnum.GENERIC_L152RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L152RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L152RETX.build.board=GENERIC_L152RETX
GenL1.menu.pnum.GENERIC_L152RETX.build.product_line=STM32L152xE
GenL1.menu.pnum.GENERIC_L152RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET

# Generic L162RETx
GenL1.menu.pnum.GENERIC_L162RETX=Generic L162RETx
GenL1.menu.pnum.GENERIC_L162RETX.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L162RETX.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L162RETX.build.board=GENERIC_L162RETX
GenL1.menu.pnum.GENERIC_L162RETX.build.product_line=STM32L162xE
GenL1.menu.pnum.GENERIC_L162RETX.build.variant=STM32L1xx/L151RET_L152RET_L162RET

# Upload menu
GenL1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL1.menu.upload_method.swdMethod.upload.protocol=0
GenL1.menu.upload_method.swdMethod.upload.options=-g
GenL1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL1.menu.upload_method.serialMethod.upload.protocol=1
GenL1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL1.menu.upload_method.dfuMethod.upload.protocol=2
GenL1.menu.upload_method.dfuMethod.upload.options=-g
GenL1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L4
GenL4.name=Generic STM32L4 series

GenL4.build.core=arduino
GenL4.build.board=GenL4
GenL4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL4.build.mcu=cortex-m4
GenL4.build.fpu=-mfpu=fpv4-sp-d16
GenL4.build.float-abi=-mfloat-abi=hard
GenL4.build.series=STM32L4xx
GenL4.build.cmsis_lib_gcc=arm_cortexM4lf_math
GenL4.upload.maximum_size=0
GenL4.upload.maximum_data_size=0

# Generic L412K8Tx
GenL4.menu.pnum.GENERIC_L412K8TX=Generic L412K8Tx
GenL4.menu.pnum.GENERIC_L412K8TX.upload.maximum_size=65536
GenL4.menu.pnum.GENERIC_L412K8TX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412K8TX.build.board=GENERIC_L412K8TX
GenL4.menu.pnum.GENERIC_L412K8TX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412K8TX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L412K8Ux
GenL4.menu.pnum.GENERIC_L412K8UX=Generic L412K8Ux
GenL4.menu.pnum.GENERIC_L412K8UX.upload.maximum_size=65536
GenL4.menu.pnum.GENERIC_L412K8UX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412K8UX.build.board=GENERIC_L412K8UX
GenL4.menu.pnum.GENERIC_L412K8UX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412K8UX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L412KBTx
GenL4.menu.pnum.GENERIC_L412KBTX=Generic L412KBTx
GenL4.menu.pnum.GENERIC_L412KBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412KBTX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412KBTX.build.board=GENERIC_L412KBTX
GenL4.menu.pnum.GENERIC_L412KBTX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412KBTX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L412KBUx
GenL4.menu.pnum.GENERIC_L412KBUX=Generic L412KBUx
GenL4.menu.pnum.GENERIC_L412KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412KBUX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412KBUX.build.board=GENERIC_L412KBUX
GenL4.menu.pnum.GENERIC_L412KBUX.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412KBUX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L422KBTx
GenL4.menu.pnum.GENERIC_L422KBTX=Generic L422KBTx
GenL4.menu.pnum.GENERIC_L422KBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L422KBTX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L422KBTX.build.board=GENERIC_L422KBTX
GenL4.menu.pnum.GENERIC_L422KBTX.build.product_line=STM32L422xx
GenL4.menu.pnum.GENERIC_L422KBTX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L422KBUx
GenL4.menu.pnum.GENERIC_L422KBUX=Generic L422KBUx
GenL4.menu.pnum.GENERIC_L422KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L422KBUX.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L422KBUX.build.board=GENERIC_L422KBUX
GenL4.menu.pnum.GENERIC_L422KBUX.build.product_line=STM32L422xx
GenL4.menu.pnum.GENERIC_L422KBUX.build.variant=STM32L4xx/L412K(8-B)(T-U)_L422KB(T-U)

# Generic L431RBIx
GenL4.menu.pnum.GENERIC_L431RBIX=Generic L431RBIx
GenL4.menu.pnum.GENERIC_L431RBIX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBIX.build.board=GENERIC_L431RBIX
GenL4.menu.pnum.GENERIC_L431RBIX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBIX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

# Generic L431RCIx
GenL4.menu.pnum.GENERIC_L431RCIX=Generic L431RCIx
GenL4.menu.pnum.GENERIC_L431RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCIX.build.board=GENERIC_L431RCIX
GenL4.menu.pnum.GENERIC_L431RCIX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCIX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

# Generic L431RBTx
GenL4.menu.pnum.GENERIC_L431RBTX=Generic L431RBTx
GenL4.menu.pnum.GENERIC_L431RBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBTX.build.board=GENERIC_L431RBTX
GenL4.menu.pnum.GENERIC_L431RBTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBTX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

