stm32duino/Arduino_Core_STM32/boards.txt
# Generic L431RCTx
GenL4.menu.pnum.GENERIC_L431RCTX=Generic L431RCTx
GenL4.menu.pnum.GENERIC_L431RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCTX.build.board=GENERIC_L431RCTX
GenL4.menu.pnum.GENERIC_L431RCTX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCTX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

# Generic L431RBYx
GenL4.menu.pnum.GENERIC_L431RBYX=Generic L431RBYx
GenL4.menu.pnum.GENERIC_L431RBYX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L431RBYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RBYX.build.board=GENERIC_L431RBYX
GenL4.menu.pnum.GENERIC_L431RBYX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RBYX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

# Generic L431RCYx
GenL4.menu.pnum.GENERIC_L431RCYX=Generic L431RCYx
GenL4.menu.pnum.GENERIC_L431RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L431RCYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L431RCYX.build.board=GENERIC_L431RCYX
GenL4.menu.pnum.GENERIC_L431RCYX.build.product_line=STM32L431xx
GenL4.menu.pnum.GENERIC_L431RCYX.build.variant=STM32L4xx/L431R(B-C)(I-T-Y)

# Generic L432KBUx
GenL4.menu.pnum.GENERIC_L432KBUX=Generic L432KBUx
GenL4.menu.pnum.GENERIC_L432KBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L432KBUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KBUX.build.board=GENERIC_L432KBUX
GenL4.menu.pnum.GENERIC_L432KBUX.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KBUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU

# Generic L432KCUx
GenL4.menu.pnum.GENERIC_L432KCUX=Generic L432KCUx
GenL4.menu.pnum.GENERIC_L432KCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L432KCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KCUX.build.board=GENERIC_L432KCUX
GenL4.menu.pnum.GENERIC_L432KCUX.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KCUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU

# Generic L442KCUx
GenL4.menu.pnum.GENERIC_L442KCUX=Generic L442KCUx
GenL4.menu.pnum.GENERIC_L442KCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L442KCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L442KCUX.build.board=GENERIC_L442KCUX
GenL4.menu.pnum.GENERIC_L442KCUX.build.product_line=STM32L442xx
GenL4.menu.pnum.GENERIC_L442KCUX.build.variant=STM32L4xx/L432K(B-C)U_L442KCU

# Generic L433CBTx
GenL4.menu.pnum.GENERIC_L433CBTX=Generic L433CBTx
GenL4.menu.pnum.GENERIC_L433CBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433CBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CBTX.build.board=GENERIC_L433CBTX
GenL4.menu.pnum.GENERIC_L433CBTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CBTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433CCTx
GenL4.menu.pnum.GENERIC_L433CCTX=Generic L433CCTx
GenL4.menu.pnum.GENERIC_L433CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CCTX.build.board=GENERIC_L433CCTX
GenL4.menu.pnum.GENERIC_L433CCTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CCTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433CBUx
GenL4.menu.pnum.GENERIC_L433CBUX=Generic L433CBUx
GenL4.menu.pnum.GENERIC_L433CBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433CBUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CBUX.build.board=GENERIC_L433CBUX
GenL4.menu.pnum.GENERIC_L433CBUX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CBUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433CCUx
GenL4.menu.pnum.GENERIC_L433CCUX=Generic L433CCUx
GenL4.menu.pnum.GENERIC_L433CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CCUX.build.board=GENERIC_L433CCUX
GenL4.menu.pnum.GENERIC_L433CCUX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CCUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP=Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCTXP.build.board=GENERIC_L433RCTXP
GenL4.menu.pnum.GENERIC_L433RCTXP.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCTXP.build.variant=STM32L4xx/L433RCTxP

# Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX=Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCTX.build.board=GENERIC_L443CCTX
GenL4.menu.pnum.GENERIC_L443CCTX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX=Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCUX.build.board=GENERIC_L443CCUX
GenL4.menu.pnum.GENERIC_L443CCUX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX=Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCIX.build.board=GENERIC_L452RCIX
GenL4.menu.pnum.GENERIC_L452RCIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX=Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452REIX.build.board=GENERIC_L452REIX
GenL4.menu.pnum.GENERIC_L452REIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX=Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCTX.build.board=GENERIC_L452RCTX
GenL4.menu.pnum.GENERIC_L452RCTX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCTX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX=Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETX.build.board=GENERIC_L452RETX
GenL4.menu.pnum.GENERIC_L452RETX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

