stm32duino/Arduino_Core_STM32/boards.txt
# Generic L486VGTx
GenL4.menu.pnum.GENERIC_L486VGTX=Generic L486VGTx
GenL4.menu.pnum.GENERIC_L486VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L486VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L486VGTX.build.board=GENERIC_L486VGTX
GenL4.menu.pnum.GENERIC_L486VGTX.build.product_line=STM32L486xx
GenL4.menu.pnum.GENERIC_L486VGTX.build.variant=STM32L4xx//L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L496ZETx
GenL4.menu.pnum.GENERIC_L496ZETX=Generic L496ZETx
GenL4.menu.pnum.GENERIC_L496ZETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L496ZETX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZETX.build.board=GENERIC_L496ZETX
GenL4.menu.pnum.GENERIC_L496ZETX.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZETX.build.variant=STM32L4xx/L4L496Z(E-G)T_L4A6ZGT

# Generic L496ZGTx
GenL4.menu.pnum.GENERIC_L496ZGTX=Generic L496ZGTx
GenL4.menu.pnum.GENERIC_L496ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZGTX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZGTX.build.board=GENERIC_L496ZGTX
GenL4.menu.pnum.GENERIC_L496ZGTX.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZGTX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT

# Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP=Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.board=GENERIC_L496ZGTXP
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP

# Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX=Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.board=GENERIC_L4A6ZGTX
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT

# Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP=Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.board=GENERIC_L4A6ZGTXP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP

# Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX=Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.board=GENERIC_L4R5VGTX
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX=Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VITX.build.board=GENERIC_L4R5VITX
GenL4.menu.pnum.GENERIC_L4R5VITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX=Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.board=GENERIC_L4R5ZGTX
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX=Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.board=GENERIC_L4R5ZGYX
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX=Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.board=GENERIC_L4R5ZITX
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX=Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.board=GENERIC_L4R5ZIYX
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP=Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.board=GENERIC_L4R5ZITXP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.variant=STM32L4xx/L4R5ZITxP

# Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX=Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7VITX.build.board=GENERIC_L4R7VITX
GenL4.menu.pnum.GENERIC_L4R7VITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX=Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.board=GENERIC_L4R7ZITX
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX=Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.board=GENERIC_L4R9ZGJX
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

