stm32duino/Arduino_Core_STM32/boards.txt
# Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX=Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.board=GENERIC_L4R9ZGYX
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX=Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.board=GENERIC_L4R9ZIJX
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

# Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX=Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.board=GENERIC_L4R9ZIYX
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX=Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5VITX.build.board=GENERIC_L4S5VITX
GenL4.menu.pnum.GENERIC_L4S5VITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX=Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.board=GENERIC_L4S5ZITX
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX=Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.board=GENERIC_L4S5ZIYX
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX=Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7VITX.build.board=GENERIC_L4S7VITX
GenL4.menu.pnum.GENERIC_L4S7VITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX=Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.board=GENERIC_L4S7ZITX
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX=Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.board=GENERIC_L4S9ZIJX
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

# Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX=Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.board=GENERIC_L4S9ZIYX
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Upload menu
GenL4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL4.menu.upload_method.swdMethod.upload.protocol=0
GenL4.menu.upload_method.swdMethod.upload.options=-g
GenL4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=1
GenL4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=2
GenL4.menu.upload_method.dfuMethod.upload.options=-g
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L5
GenL5.name=Generic STM32L5 series

GenL5.build.core=arduino
GenL5.build.board=GenL5
GenL5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL5.build.mcu=cortex-m33
GenL5.build.fpu=-mfpu=fpv4-sp-d16
GenL5.build.float-abi=-mfloat-abi=hard
GenL5.build.series=STM32L5xx
GenL5.build.cmsis_lib_gcc=arm_ARMv8MMLlfsp_math
GenL5.upload.maximum_size=0
GenL5.upload.maximum_data_size=0

# Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ=Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_size=262144
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.board=GENERIC_L552ZCTXQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ

# Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ=Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.board=GENERIC_L552ZETXQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ

