stm32duino/Arduino_Core_STM32/boards.txt
# Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ=Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.board=GENERIC_L562ZETXQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.product_line=STM32L562xx
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ

# Upload menu
GenL5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL5.menu.upload_method.swdMethod.upload.protocol=0
GenL5.menu.upload_method.swdMethod.upload.options=-g
GenL5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL5.menu.upload_method.serialMethod.upload.protocol=1
GenL5.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL5.menu.upload_method.dfuMethod.upload.protocol=2
GenL5.menu.upload_method.dfuMethod.upload.options=-g
GenL5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic U5
GenU5.name=Generic STM32U5 series

GenU5.build.core=arduino
GenU5.build.board=GenU5
GenU5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenU5.build.mcu=cortex-m33
GenU5.build.fpu=-mfpu=fpv4-sp-d16
GenU5.build.float-abi=-mfloat-abi=hard
GenU5.build.series=STM32U5xx
GenU5.build.cmsis_lib_gcc=arm_ARMv8MMLlfsp_math
GenU5.upload.maximum_size=0
GenU5.upload.maximum_data_size=0

# Generic U575AGIxQ
GenU5.menu.pnum.GENERIC_U575AGIXQ=Generic U575AGIxQ
GenU5.menu.pnum.GENERIC_U575AGIXQ.upload.maximum_size=1048576
GenU5.menu.pnum.GENERIC_U575AGIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.board=GENERIC_U575AGIXQ
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ

# Generic U575AIIxQ
GenU5.menu.pnum.GENERIC_U575AIIXQ=Generic U575AIIxQ
GenU5.menu.pnum.GENERIC_U575AIIXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575AIIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.board=GENERIC_U575AIIXQ
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ

# Generic U575ZGTxQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ=Generic U575ZGTxQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ.upload.maximum_size=1048576
GenU5.menu.pnum.GENERIC_U575ZGTXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.board=GENERIC_U575ZGTXQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ

# Generic U575ZITxQ
GenU5.menu.pnum.GENERIC_U575ZITXQ=Generic U575ZITxQ
GenU5.menu.pnum.GENERIC_U575ZITXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575ZITXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.board=GENERIC_U575ZITXQ
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ

# Generic U585ZITxQ
GenU5.menu.pnum.GENERIC_U585ZITXQ=Generic U585ZITxQ
GenU5.menu.pnum.GENERIC_U585ZITXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585ZITXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.board=GENERIC_U585ZITXQ
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ

# Generic U585AIIxQ
GenU5.menu.pnum.GENERIC_U585AIIXQ=Generic U585AIIxQ
GenU5.menu.pnum.GENERIC_U585AIIXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585AIIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.board=GENERIC_U585AIIXQ
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ

# Upload menu
GenU5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU5.menu.upload_method.swdMethod.upload.protocol=0
GenU5.menu.upload_method.swdMethod.upload.options=-g
GenU5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU5.menu.upload_method.serialMethod.upload.protocol=1
GenU5.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenU5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU5.menu.upload_method.dfuMethod.upload.protocol=2
GenU5.menu.upload_method.dfuMethod.upload.options=-g
GenU5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic WB
GenWB.name=Generic STM32WB series

GenWB.build.core=arduino
GenWB.build.board=GenWB
GenWB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenWB.build.mcu=cortex-m4
GenWB.build.fpu=-mfpu=fpv4-sp-d16
GenWB.build.float-abi=-mfloat-abi=hard
GenWB.build.series=STM32WBxx
GenWB.build.cmsis_lib_gcc=arm_cortexM4lf_math
GenWB.upload.maximum_size=0
GenWB.upload.maximum_data_size=0

# Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX=Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55CCUX.build.board=GENERIC_WB55CCUX
GenWB.menu.pnum.GENERIC_WB55CCUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CCUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX=Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CEUX.build.board=GENERIC_WB55CEUX
GenWB.menu.pnum.GENERIC_WB55CEUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CEUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX=Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CGUX.build.board=GENERIC_WB55CGUX
GenWB.menu.pnum.GENERIC_WB55CGUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CGUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX=Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_size=827392
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.board=GENERIC_WB5MMGHX
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.product_line=STM32WB5Mxx
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.variant=STM32WBxx/WB5MMGH

# Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX=Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55RCVX.build.board=GENERIC_WB55RCVX
GenWB.menu.pnum.GENERIC_WB55RCVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RCVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX=Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55REVX.build.board=GENERIC_WB55REVX
GenWB.menu.pnum.GENERIC_WB55REVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55REVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX=Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RGVX.build.board=GENERIC_WB55RGVX
GenWB.menu.pnum.GENERIC_WB55RGVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RGVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Upload menu
GenWB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB.menu.upload_method.swdMethod.upload.protocol=0
GenWB.menu.upload_method.swdMethod.upload.options=-g
GenWB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB.menu.upload_method.serialMethod.upload.protocol=1
GenWB.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenWB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWB.menu.upload_method.dfuMethod.upload.protocol=2
GenWB.menu.upload_method.dfuMethod.upload.options=-g
GenWB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic WL
GenWL.name=Generic STM32WL series

GenWL.build.core=arduino
GenWL.build.board=GenWL
GenWL.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
GenWL.build.mcu=cortex-m4
#GenWL.build.fpu=-mfpu=fpv4-sp-d16
#GenWL.build.float-abi=-mfloat-abi=hard
GenWL.build.series=STM32WLxx
GenWL.build.cmsis_lib_gcc=arm_cortexM4l_math
GenWL.upload.maximum_size=0
GenWL.upload.maximum_data_size=0

