stm32duino/Arduino_Core_STM32/boards.txt
# MALYANM200_F103CB board
3dprinter.menu.pnum.MALYANM200_F103CB=Malyan M200 V1
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_data_size=20480
3dprinter.menu.pnum.MALYANM200_F103CB.build.mcu=cortex-m3
3dprinter.menu.pnum.MALYANM200_F103CB.build.board=MALYANM200_F103CB
3dprinter.menu.pnum.MALYANM200_F103CB.build.series=STM32F1xx
3dprinter.menu.pnum.MALYANM200_F103CB.build.product_line=STM32F103xB
3dprinter.menu.pnum.MALYANM200_F103CB.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
3dprinter.menu.pnum.MALYANM200_F103CB.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.MALYANM200_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
3dprinter.menu.pnum.MALYANM200_F103CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F103CB.build.flash_offset=0x2000
3dprinter.menu.pnum.MALYANM200_F103CB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# MALYANM200_F070CB board
3dprinter.menu.pnum.MALYANM200_F070CB=Malyan M200 V2
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_data_size=15168
3dprinter.menu.pnum.MALYANM200_F070CB.build.mcu=cortex-m0
3dprinter.menu.pnum.MALYANM200_F070CB.build.board=MALYANM200_F070CB
3dprinter.menu.pnum.MALYANM200_F070CB.build.series=STM32F0xx
3dprinter.menu.pnum.MALYANM200_F070CB.build.product_line=STM32F070xB
3dprinter.menu.pnum.MALYANM200_F070CB.build.variant=STM32F0xx/F070CBT
3dprinter.menu.pnum.MALYANM200_F070CB.build.variant_h=variant_MALYANMx00_F070CB.h
3dprinter.menu.pnum.MALYANM200_F070CB.build.cmsis_lib_gcc=arm_cortexM0l_math
3dprinter.menu.pnum.MALYANM200_F070CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F070CB.build.ldscript=MALYANMx00_F070CB.ld
3dprinter.menu.pnum.MALYANM200_F070CB.build.flash_offset=0x2000
3dprinter.menu.pnum.MALYANM200_F070CB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# MALYANM300_F070CB board
3dprinter.menu.pnum.MALYANM300_F070CB=Malyan M300
3dprinter.menu.pnum.MALYANM300_F070CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM300_F070CB.upload.maximum_data_size=15168
3dprinter.menu.pnum.MALYANM300_F070CB.build.mcu=cortex-m0
3dprinter.menu.pnum.MALYANM300_F070CB.build.board=MALYANM300_F070CB
3dprinter.menu.pnum.MALYANM300_F070CB.build.series=STM32F0xx
3dprinter.menu.pnum.MALYANM300_F070CB.build.product_line=STM32F070xB
3dprinter.menu.pnum.MALYANM300_F070CB.build.variant=STM32F0xx/F070CBT
3dprinter.menu.pnum.MALYANM300_F070CB.build.variant_h=variant_MALYANMx00_F070CB.h
3dprinter.menu.pnum.MALYANM300_F070CB.build.cmsis_lib_gcc=arm_cortexM0l_math
3dprinter.menu.pnum.MALYANM300_F070CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F070CB.build.ldscript=MALYANMx00_F070CB.ld
3dprinter.menu.pnum.MALYANM300_F070CB.build.flash_offset=0x2000
3dprinter.menu.pnum.MALYANM300_F070CB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# VAkE v1.0
3dprinter.menu.pnum.VAKE_V1=VAkE v1.0
3dprinter.menu.pnum.VAKE_V1.upload.maximum_size=524288
3dprinter.menu.pnum.VAKE_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.VAKE_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.VAKE_V1.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.VAKE_V1.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.VAKE_V1.build.board=VAKE_V1
3dprinter.menu.pnum.VAKE_V1.build.series=STM32F4xx
3dprinter.menu.pnum.VAKE_V1.build.product_line=STM32F446xx
3dprinter.menu.pnum.VAKE_V1.build.variant=STM32F4xx/F446V(C-E)T
3dprinter.menu.pnum.VAKE_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.VAKE_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# FYSETC_S6 board
3dprinter.menu.pnum.FYSETC_S6=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_size=458752
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_data_size=131072
3dprinter.menu.pnum.FYSETC_S6.build.mcu=cortex-m4
3dprinter.menu.pnum.FYSETC_S6.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.FYSETC_S6.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.FYSETC_S6.build.board=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.build.series=STM32F4xx
3dprinter.menu.pnum.FYSETC_S6.build.product_line=STM32F446xx
3dprinter.menu.pnum.FYSETC_S6.build.variant=STM32F4xx/F446V(C-E)T
3dprinter.menu.pnum.FYSETC_S6.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.FYSETC_S6.build.cmsis_lib_gcc=arm_cortexM4lf_math
3dprinter.menu.pnum.FYSETC_S6.build.flash_offset=0x10000
3dprinter.menu.pnum.FYSETC_S6.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# Upload menu
3dprinter.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
3dprinter.menu.upload_method.swdMethod.upload.protocol=0
3dprinter.menu.upload_method.swdMethod.upload.options=-g
3dprinter.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
3dprinter.menu.upload_method.serialMethod.upload.protocol=1
3dprinter.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
3dprinter.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
3dprinter.menu.upload_method.dfuMethod.upload.protocol=2
3dprinter.menu.upload_method.dfuMethod.upload.options=-g
3dprinter.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Blues Wireless boards

BluesW.name=Blues Wireless boards

BluesW.build.core=arduino
BluesW.build.board=BluesWireless
BluesW.build.variant_h=variant_{build.board}.h
BluesW.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
BluesW.upload.maximum_size=0
BluesW.upload.maximum_data_size=0

# Swan R5 board
BluesW.menu.pnum.SWAN_R5=Swan R5
BluesW.menu.pnum.SWAN_R5.upload.maximum_size=2097152
BluesW.menu.pnum.SWAN_R5.upload.maximum_data_size=655360
BluesW.menu.pnum.SWAN_R5.build.mcu=cortex-m4
BluesW.menu.pnum.SWAN_R5.build.cmsis_lib_gcc=arm_cortexM4lf_math
BluesW.menu.pnum.SWAN_R5.build.fpu=-mfpu=fpv4-sp-d16
BluesW.menu.pnum.SWAN_R5.build.float-abi=-mfloat-abi=hard
BluesW.menu.pnum.SWAN_R5.build.board=SWAN_R5
BluesW.menu.pnum.SWAN_R5.build.series=STM32L4xx
BluesW.menu.pnum.SWAN_R5.build.product_line=STM32L4R5xx
BluesW.menu.pnum.SWAN_R5.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
BluesW.menu.pnum.SWAN_R5.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
BluesW.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
BluesW.menu.upload_method.swdMethod.upload.protocol=0
BluesW.menu.upload_method.swdMethod.upload.options=-g
BluesW.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

