stm32duino/Arduino_Core_STM32/boards.txt
BluesW.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
BluesW.menu.upload_method.serialMethod.upload.protocol=1
BluesW.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
BluesW.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

BluesW.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
BluesW.menu.upload_method.dfuMethod.upload.protocol=2
BluesW.menu.upload_method.dfuMethod.upload.options=-g
BluesW.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Elecgator boards

Elecgator.name=Elecgator boards

Elecgator.build.core=arduino
Elecgator.build.board=elecgator
Elecgator.build.variant_h=variant_{build.board}.h
Elecgator.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Elecgator.upload.maximum_size=0
Elecgator.upload.maximum_data_size=0

# EtherCATduino board
Elecgator.menu.pnum.ETHERCAT_DUINO=EtherCATduino
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_size=524288
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_data_size=327680
Elecgator.menu.pnum.ETHERCAT_DUINO.build.mcu=cortex-m7
Elecgator.menu.pnum.ETHERCAT_DUINO.build.fpu=-mfpu=fpv4-sp-d16
Elecgator.menu.pnum.ETHERCAT_DUINO.build.float-abi=-mfloat-abi=hard
Elecgator.menu.pnum.ETHERCAT_DUINO.build.board=ETHERCAT_DUINO
Elecgator.menu.pnum.ETHERCAT_DUINO.build.series=STM32F7xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.product_line=STM32F746xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)
Elecgator.menu.pnum.ETHERCAT_DUINO.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Elecgator.menu.pnum.ETHERCAT_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
Elecgator.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Elecgator.menu.upload_method.swdMethod.upload.protocol=0
Elecgator.menu.upload_method.swdMethod.upload.options=-g
Elecgator.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Elecgator.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Elecgator.menu.upload_method.dfuMethod.upload.protocol=2
Elecgator.menu.upload_method.dfuMethod.upload.options=-g
Elecgator.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.variant_h=variant_{build.board}.h
ESC_board.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
ESC_board.upload.maximum_size=0
ESC_board.upload.maximum_data_size=0

# WRAITH32_V1 board
ESC_board.menu.pnum.WRAITH32_V1=Wraith V1 ESC
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.WRAITH32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.WRAITH32_V1.build.board=WRAITH32_V1
ESC_board.menu.pnum.WRAITH32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.WRAITH32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.WRAITH32_V1.build.variant=STM32F0xx/F051K(6-8)U
ESC_board.menu.pnum.WRAITH32_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ESC_board.menu.pnum.WRAITH32_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

# STORM32_V1_RC board
ESC_board.menu.pnum.STORM32_V1_31_RC=STorM32 BGC v1.31 RC
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_size=262144
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_data_size=49152
ESC_board.menu.pnum.STORM32_V1_31_RC.build.mcu=cortex-m3
ESC_board.menu.pnum.STORM32_V1_31_RC.build.board=STORM32_V1_31_RC
ESC_board.menu.pnum.STORM32_V1_31_RC.build.series=STM32F1xx
ESC_board.menu.pnum.STORM32_V1_31_RC.build.product_line=STM32F103xE
ESC_board.menu.pnum.STORM32_V1_31_RC.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ESC_board.menu.pnum.STORM32_V1_31_RC.build.cmsis_lib_gcc=arm_cortexM3l_math
ESC_board.menu.pnum.STORM32_V1_31_RC.build.variant=STM32F1xx/F103R(C-D-E)T

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=0
ESC_board.menu.upload_method.swdMethod.upload.options=-g
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=1
ESC_board.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=2
ESC_board.menu.upload_method.dfuMethod.upload.options=-g
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Garatronic-McHobby STM32 boards

Garatronic.name=Garatronic-McHobby

Garatronic.build.core=arduino
Garatronic.build.board=Garatronic
Garatronic.build.variant_h=variant_{build.board}.h
Garatronic.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Garatronic.upload.maximum_size=0
Garatronic.upload.maximum_data_size=0

# PYBSTICK26(DUINO) board with F072RB
Garatronic.menu.pnum.PYBSTICK26_DUINO=PYBSTICK26 Duino
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_size=131072
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_data_size=16384
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.mcu=cortex-m0
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.board=PYBSTICK26_DUINO
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.series=STM32F0xx
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.product_line=STM32F072xB
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.cmsis_lib_gcc=arm_cortexM0l_math

# PYBSTICK26(LITE) board with F401CE
Garatronic.menu.pnum.PYBSTICK26_LITE=PYBSTICK26 Lite
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_data_size=98304
Garatronic.menu.pnum.PYBSTICK26_LITE.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_LITE.build.board=PYBSTICK26_LITE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_LITE.build.product_line=STM32F401xE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
Garatronic.menu.pnum.PYBSTICK26_LITE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_LITE.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_LITE.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_LITE.build.float-abi=-mfloat-abi=hard

# PYBSTICK26(STD/Programmez!) board with F411RE
Garatronic.menu.pnum.PYBSTICK26_STD=PYBSTICK26 STD-Programmez
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_data_size=131072
Garatronic.menu.pnum.PYBSTICK26_STD.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_STD.build.board=PYBSTICK26_STD
Garatronic.menu.pnum.PYBSTICK26_STD.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_STD.build.product_line=STM32F411xE
Garatronic.menu.pnum.PYBSTICK26_STD.build.variant=STM32F4xx/F411R(C-E)T
Garatronic.menu.pnum.PYBSTICK26_STD.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_STD.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_STD.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_STD.build.float-abi=-mfloat-abi=hard

# PYBSTICK26(PRO) board with F412RE
Garatronic.menu.pnum.PYBSTICK26_PRO=PYBSTICK26 Pro
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_data_size=262144
Garatronic.menu.pnum.PYBSTICK26_PRO.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_PRO.build.board=PYBSTICK26_PRO
Garatronic.menu.pnum.PYBSTICK26_PRO.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.product_line=STM32F412Rx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)
Garatronic.menu.pnum.PYBSTICK26_PRO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_PRO.build.cmsis_lib_gcc=arm_cortexM4lf_math
Garatronic.menu.pnum.PYBSTICK26_PRO.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_PRO.build.float-abi=-mfloat-abi=hard

# PYBSTICK26 boards upload method
Garatronic.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Garatronic.menu.upload_method.dfuMethod.upload.protocol=2
Garatronic.menu.upload_method.dfuMethod.upload.options=-g
Garatronic.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic Flight Controllers

